#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.realfire_dev.cloudflare_record.terraform_managed_resource_a04900f1cff0cc9df186393625e9d629: Refreshing state... [id=a04900f1cff0cc9df186393625e9d629]
module.realfire_link.cloudflare_record.terraform_managed_resource_4f093e0e15b521612f05d72708c92968: Refreshing state... [id=4f093e0e15b521612f05d72708c92968]
module.realfire_au.cloudflare_record.terraform_managed_resource_b5500d4b699a1e57af92ba3ed030c37e: Refreshing state... [id=b5500d4b699a1e57af92ba3ed030c37e]
module.realfire_dev.cloudflare_record.terraform_managed_resource_456bc27d090bc1bccd3ec0247e514feb: Refreshing state... [id=456bc27d090bc1bccd3ec0247e514feb]
module.protectedpii_com.cloudflare_record.dmarc: Refreshing state... [id=dddea226ef92db2c65f2ea2c8e01d0f5]
module.realfire_cloud.cloudflare_record.terraform_managed_resource_1b00ada15f8487843dc8e90f51defc59: Refreshing state... [id=1b00ada15f8487843dc8e90f51defc59]
module.protectedpii_com.cloudflare_record.mx3: Refreshing state... [id=a80a816ed0424ab0619f3cf4f7ac427e]
module.protectedpii_com.cloudflare_email_routing_catch_all.catch_all: Refreshing state... [id=0c7c656274f7471b93a4a13b7043404c]
module.protectedpii_com.cloudflare_email_routing_settings.email_settings: Refreshing state... [id=25d563c95e0021b9a4f2475d2d470a9e]
module.realfire_cloud.cloudflare_record.terraform_managed_resource_5c5abc0fdccae3cbb41c7396281f3aba: Refreshing state... [id=5c5abc0fdccae3cbb41c7396281f3aba]
module.realfire_link.cloudflare_record.terraform_managed_resource_04ef8770273f24a074905cf94aa0eb81: Refreshing state... [id=04ef8770273f24a074905cf94aa0eb81]
module.realfire_au.cloudflare_record.terraform_managed_resource_b007352f3aab9a5cbf1a2360333cd9e8: Refreshing state... [id=b007352f3aab9a5cbf1a2360333cd9e8]
module.realfire_au.cloudflare_record.terraform_managed_resource_71ecf873ed39bc95ac289c5fbdd53a80: Refreshing state... [id=71ecf873ed39bc95ac289c5fbdd53a80]
module.realfire_network.cloudflare_record.terraform_managed_resource_d48979982bf0ad0d5be5e2c9e6cb6220: Refreshing state... [id=d48979982bf0ad0d5be5e2c9e6cb6220]
module.realfire_dev.cloudflare_record.terraform_managed_resource_e20a1ba9cd2b4da5da3a43db02d6ae93: Refreshing state... [id=e20a1ba9cd2b4da5da3a43db02d6ae93]
module.realfire_dev.cloudflare_record.terraform_managed_resource_59094dbe266e0ec82604fe359036edb0: Refreshing state... [id=59094dbe266e0ec82604fe359036edb0]
module.realfire_cloud.cloudflare_record.terraform_managed_resource_6910f22baeb25b9122f798ffc168ad21: Refreshing state... [id=6910f22baeb25b9122f798ffc168ad21]
module.realfire_network.cloudflare_record.terraform_managed_resource_fe8df75f03f61295e0eb9dc36661b090: Refreshing state... [id=fe8df75f03f61295e0eb9dc36661b090]
module.realfire_dev.cloudflare_record.terraform_managed_resource_4aa00e4f7986c4ecff9a6f5a1a6f12bc: Refreshing state... [id=4aa00e4f7986c4ecff9a6f5a1a6f12bc]
module.protectedpii_com.cloudflare_record.mx2: Refreshing state... [id=883ca8a7d6e71546e85880cea87f3cd6]
module.realfire_link.cloudflare_record.terraform_managed_resource_edc1472a0262c4b18110a68391c6a080: Refreshing state... [id=edc1472a0262c4b18110a68391c6a080]
cloudflare_email_routing_address.primary: Refreshing state... [id=57952d0cc3b84413b67d3a748dba9cc3]
module.protectedpii_com.cloudflare_record.spf: Refreshing state... [id=75f72bfc70ca2cb77a14324603d89793]
module.realfire_au.cloudflare_record.terraform_managed_resource_ac8ab0f6be08bcffce56effa487da6ca: Refreshing state... [id=ac8ab0f6be08bcffce56effa487da6ca]
module.protectedpii_com.cloudflare_record.mx: Refreshing state... [id=a56093eb8b51f6c19093d14a5806be87]
module.realfire_link.cloudflare_record.terraform_managed_resource_2726bfcb3d4468cd0087c2a57d005f6c: Refreshing state... [id=2726bfcb3d4468cd0087c2a57d005f6c]
module.realfire_cloud.cloudflare_record.terraform_managed_resource_b2c5dd3a2faeda844cfceeff25f5c827: Refreshing state... [id=b2c5dd3a2faeda844cfceeff25f5c827]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.protectedpii_com.cloudflare_email_routing_catch_all.catch_all will be destroyed
  # (because cloudflare_email_routing_catch_all.catch_all is not in configuration)
  - resource "cloudflare_email_routing_catch_all" "catch_all" {
      - enabled = true -> null
      - id      = "0c7c656274f7471b93a4a13b7043404c" -> null
      - name    = "protectedpii.com catch_all" -> null
      - zone_id = "25d563c95e0021b9a4f2475d2d470a9e" -> null

      - action {
          - type  = "forward" -> null
          - value = [
              - "martin@hylandnet.works",
            ] -> null
        }

      - matcher {
          - type = "all" -> null
        }
    }

  # module.protectedpii_com.cloudflare_email_routing_settings.email_settings will be destroyed
  # (because cloudflare_email_routing_settings.email_settings is not in configuration)
  - resource "cloudflare_email_routing_settings" "email_settings" {
      - created     = "2022-08-11T05:07:27Z" -> null
      - enabled     = true -> null
      - id          = "25d563c95e0021b9a4f2475d2d470a9e" -> null
      - modified    = "2023-10-03T03:08:29Z" -> null
      - name        = "protectedpii.com" -> null
      - skip_wizard = true -> null
      - status      = "ready" -> null
      - zone_id     = "25d563c95e0021b9a4f2475d2d470a9e" -> null
    }

  # module.protectedpii_com.cloudflare_record.fastmail-dkim1 will be created
  + resource "cloudflare_record" "fastmail-dkim1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fm1._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "CNAME"
      + value           = "fm1.protectedpii.com.dkim.fmhosted.com"
      + zone_id         = "25d563c95e0021b9a4f2475d2d470a9e"
    }

  # module.protectedpii_com.cloudflare_record.fastmail-dkim2 will be created
  + resource "cloudflare_record" "fastmail-dkim2" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fm2._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "CNAME"
      + value           = "fm2.protectedpii.com.dkim.fmhosted.com"
      + zone_id         = "25d563c95e0021b9a4f2475d2d470a9e"
    }

  # module.protectedpii_com.cloudflare_record.fastmail-dkim3 will be created
  + resource "cloudflare_record" "fastmail-dkim3" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "fm3._domainkey"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "CNAME"
      + value           = "fm3.protectedpii.com.dkim.fmhosted.com"
      + zone_id         = "25d563c95e0021b9a4f2475d2d470a9e"
    }

  # module.protectedpii_com.cloudflare_record.mx will be updated in-place
  ~ resource "cloudflare_record" "mx" {
      + allow_overwrite = false
        id              = "a56093eb8b51f6c19093d14a5806be87"
        name            = "protectedpii.com"
      ~ priority        = 70 -> 10
        tags            = []
      ~ value           = "route3.mx.cloudflare.net" -> "in1-smtp.messagingengine.com"
        # (9 unchanged attributes hidden)
    }

  # module.protectedpii_com.cloudflare_record.mx2 will be updated in-place
  ~ resource "cloudflare_record" "mx2" {
      + allow_overwrite = false
        id              = "883ca8a7d6e71546e85880cea87f3cd6"
        name            = "protectedpii.com"
      ~ priority        = 18 -> 20
        tags            = []
      ~ value           = "route2.mx.cloudflare.net" -> "in2-smtp.messagingengine.com"
        # (9 unchanged attributes hidden)
    }

  # module.protectedpii_com.cloudflare_record.mx3 will be destroyed
  # (because cloudflare_record.mx3 is not in configuration)
  - resource "cloudflare_record" "mx3" {
      - created_on  = "2022-08-11T05:07:50.595547Z" -> null
      - hostname    = "protectedpii.com" -> null
      - id          = "a80a816ed0424ab0619f3cf4f7ac427e" -> null
      - metadata    = {
          - "auto_added"             = "false"
          - "email_routing"          = "true"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "read_only"              = "true"
          - "source"                 = "primary"
        } -> null
      - modified_on = "2022-08-11T05:07:50.595547Z" -> null
      - name        = "protectedpii.com" -> null
      - priority    = 22 -> null
      - proxiable   = false -> null
      - proxied     = false -> null
      - tags        = [] -> null
      - ttl         = 1 -> null
      - type        = "MX" -> null
      - value       = "route1.mx.cloudflare.net" -> null
      - zone_id     = "25d563c95e0021b9a4f2475d2d470a9e" -> null
    }

  # module.protectedpii_com.cloudflare_record.spf will be updated in-place
  ~ resource "cloudflare_record" "spf" {
      + allow_overwrite = false
        id              = "75f72bfc70ca2cb77a14324603d89793"
        name            = "protectedpii.com"
        tags            = []
      ~ value           = "v=spf1 include:_spf.mx.cloudflare.net ~all" -> "v=spf1 include:spf.messagingengine.com ?all"
        # (9 unchanged attributes hidden)
    }

Plan: 3 to add, 3 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @RealFireAU, Action: `pull_request`, Workflow: `Terraform Plan`*